# -*- org-use-property-inheritance: t; -*-
#+TITLE: Setting up Gitlab
#+AUTHOR: Hippie Hacker and James Blair
#+EMAIL: hh@ii.coop and mail@jamesblair.net
#+CREATOR: ii.coop + Inland Revenue
#+DATE: 5th of October, 2018
#+PROPERTY: header-args:tmate :socket /tmp/br-right.isocket
#+PROPERTY: header-args:tmate :session br-right:misc
#+PROPERTY: header-args:tmux :socket /tmp/br-right.isocket
#+PROPERTY: header-args:tmux :session br-right:misc

*** Create an external IP

 We will need the external IP to point our DNS subdomain DNS to. Additionally we
 will use that ip within the gitlab chart.

 We first create an external-ip

 #+NAME: Create the external IP
 #+BEGIN_SRC tmux :session br:gitlab
 export PROJECT=recodenz
 export CLUSTER_NAME=gitlab-cluster
 export REGION=us-central1
 gcloud compute addresses create ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT
 #+END_SRC

 #+NAME: Retrieve ingress IP
 #+BEGIN_SRC tmux :session br:gitlab
 export PROJECT=recodenz
 export CLUSTER_NAME=gitlab-cluster
 export REGION=us-central1
 gcloud compute addresses describe ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT --format='value(address)'
 #+END_SRC

 #+NAME: ingress_ip
 #+BEGIN_SRC shell 
 export PROJECT=recodenz
 export CLUSTER_NAME=gitlab-cluster
 export REGION=us-central1
 gcloud compute addresses describe ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT --format='value(address)'
 #+END_SRC

 #+RESULTS: ingress_ip
 : 35.193.219.220

** Using Catalyst (Openstack+Magnum)

You can launch a cluster manually, but to use the API you'll need to [[http://docs.catalystcloud.io/key-concepts/access.html?highlight=white%2520list][create a ticket to whitelist your IP.]]

Visit  [[https://dashboard.cloud.catalyst.net.nz/management/tickets/create/][the dashboard ticket system]] and ask for your IP to be added to the whitelist. 

#+NAME: os_auth_url
#+BEGIN_SRC tmate :session hh-right:foo
  (
    . ~/Downloads/iicoop-openrc.sh
    TIMEOUT=1
    OS_HOST=$(echo $OS_AUTH_URL | awk -F/ '{print $3}' | awk -F: '{print $1}')
    OS_PORT=$(echo $OS_AUTH_URL | awk -F/ '{print $3}' | awk -F: '{print $2}')
    echo $OS_AUTH_URL
  ) 2>&1
#+END_SRC
#+NAME: os_auth_url
#+BEGIN_SRC shell :exports both :results code
  (
    . ~/Downloads/iicoop-openrc.sh
    TIMEOUT=1
    curl -s -S -m $TIMEOUT $OS_AUTH_URL
    OS_HOST=$(echo $OS_AUTH_URL | awk -F/ '{print $3}' | awk -F: '{print $1}')
    OS_PORT=$(echo $OS_AUTH_URL | awk -F/ '{print $3}' | awk -F: '{print $2}')
    nc -vvv -w $TIMEOUT $OS_HOST $OS_PORT
    
    echo $OS_AUTH_URL
  ) 2>&1
#+END_SRC

#+RESULTS: os_auth_url
| curl:                                         | (28)    | Connection | timed                         | out  | after |  5001 | milliseconds |      |           |     |    |          |
| nc:                                           | connect | to         | api.nz-hlz-1.catalystcloud.io | port |  5000 | (tcp) | timed        | out: | Operation | now | in | progress |
| https://api.nz-hlz-1.catalystcloud.io:5000/v3 |         |            |                               |      |       |       |              |      |           |     |    |          |


#+NAME: my_ip
#+BEGIN_SRC shell
curl https://ifconfig.co
#+END_SRC

#+RESULTS: my_ip
: 103.26.16.43

*** Create an external IP

 We will need the external IP to point our DNS subdomain DNS to. Additionally we
 will use that ip within the gitlab chart.

 We first create an external-ip

 #+NAME: Create the external IP
 #+BEGIN_SRC tmux :session br:gitlab
 export PROJECT=recodenz
 export CLUSTER_NAME=gitlab-cluster
 export REGION=us-central1
 gcloud compute addresses create ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT
 #+END_SRC

 #+NAME: Retrieve ingress IP
 #+BEGIN_SRC tmux :session br:gitlab
 export PROJECT=recodenz
 export CLUSTER_NAME=gitlab-cluster
 export REGION=us-central1
 gcloud compute addresses describe ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT --format='value(address)'
 #+END_SRC

 #+NAME: ingress_ip
 #+BEGIN_SRC shell 
 export PROJECT=recodenz
 export CLUSTER_NAME=gitlab-cluster
 export REGION=us-central1
 gcloud compute addresses describe ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT --format='value(address)'
 #+END_SRC

 #+RESULTS: ingress_ip
 : 35.193.219.220
>>>>>>> Stashed changes

  We will need the external IP to point our DNS subdomain DNS to. Additionally we
  will use that ip within the gitlab chart.

  We first create an external-ip

  #+NAME: Create the external IP
  #+BEGIN_SRC tmux :session br-right:misc
  export PROJECT=recodenz
  export CLUSTER_NAME=gitlab-cluster
  export REGION=us-central1
  gcloud compute addresses create ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT
  #+END_SRC

  #+NAME: Retrieve ingress IP
  #+BEGIN_SRC tmux :session br-right:misc
  export PROJECT=recodenz
  export CLUSTER_NAME=gitlab-cluster
  export REGION=us-central1
  gcloud compute addresses describe ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT --format='value(address)'
  #+END_SRC

  #+NAME: ingress_ip
  #+BEGIN_SRC shell 
  export PROJECT=recodenz
  export CLUSTER_NAME=gitlab-cluster
  export REGION=us-central1
  gcloud compute addresses describe ${CLUSTER_NAME}-external-ip --region $REGION --project $PROJECT --format='value(address)'
  #+END_SRC

  #+RESULTS: ingress_ip
  : 35.193.219.220

*** Connecting the right pair / isocket

#+NAME: right_session_create
#+BEGIN_SRC shell :var session="ii-right" terminal_exec="xterm -e" user="root" host="apisnoop.cncf.io" :session nil :results silent
  $terminal_exec \
      "ssh -att \
           -L /tmp/.$session.isocket:/tmp/.$session.isocket \
           -l $user \
           $host \
      tmate -S /tmp/.$session.isocket \
            new-session \
            -A \
            -s $session \
            -n misc" \
  &
#+END_SRC


 #+NAME: right_session_join
 #+BEGIN_SRC shell :results silent
 export SESSION=api-snoop
 export XTERM_EXEC="roxterm -e"
 $XTERM_EXEC ssh -Att root@apisnoop.cncf.io \
  tmate -S /tmp/.$SESSION.isocket \
   at \; sleep 9999
 #+END_SRC

 #+NAME: right_session_setup
 #+BEGIN_SRC shell :results verbatim
 export SESSION=api-snoop
 echo ssh -tt root@apisnoop.cncf.io \
  tmate -S /tmp/.$SESSION.isocket \
    new-window -n session \
     bash
 #+END_SRC

 #+NAME: right_session
 #+BEGIN_SRC shell :cache yes :wrap "SRC text :noeval" :results verbatim
 export SESSION=api-snoop
 ssh -tt root@apisnoop.cncf.io \
  tmate -S /tmp/.$SESSION.isocket display -p \'#{tmate_ssh}\'
 #+END_SRC

 #+RESULTS[dd96525b42bbbe741e292e99ad5f3592a7163025]: right_session
 #+BEGIN_SRC text :noeval
 ssh mJrsCgvGTOTOFagYpBKvRf7EE@sf2.tmate.io
 #+END_SRC





 #+NAME: give this to your pair
 #+BEGIN_SRC bash :noweb yes :var left_session=left_session() right_session=right_session()
 echo "ii pair session ready
 left: $left_session
 right: $right_session
 "
 #+END_SRC

 #+RESULTS: give this to your pair
 | ii     | pair | session | ready |
 | left:  | nil  |         |       |
 | right: | nil  |         |       |
 |        |      |         |       |

